app/controllers/api/v1/api_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
      def user_token_encode_and_decode(token)
        begin
          decoded_token = JWT.decode(token, ENV['SECRET_KEY_BASE'], true, algorithm: 'HS256')
        rescue JWT::DecodeError => e
          return render json: { error: e.message }, status: :unauthorized
        end
        user_id = decoded_token[0]['user_id']
        user = User.find_by(id: user_id)